src/InformationRegisters/AddressClassifier.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>AddressClassifier</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Abbreviation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PostalCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AlternativeNames</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>AddressItemType</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Code</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AddressClassifierUnitCodeInCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ProvinceCodeInCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CityCodeInCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DistrictCodeInCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StreetCodeInCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/AddressClassifier/Forms/AddressClassifierClearForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Block of functions - event handlers
//

// Handler of event "OnCreateAtServer" of form
// Fills table using template
//
&AtServer
Procedure OnCreateAtServer(Cancellation, StandardProcessing)
	
	FillTableByAddressClassifierUnitsLayout();
	
EndProcedure

// Handler of the event "selection" of the form item AddressClassifierUnits
// Inverts flag of address unit choice
//
&AtClient
Procedure AddressClassifierUnitsSelection(Item, RowSelected, Field, StandardProcessing)
	Item.CurrentData.Check = NOT Item.CurrentData.Check;
EndProcedure

// Handler of command bar click event
// of form item AddressClassifierUnits.
// Raises choice flag for all address units in the list
//
&AtClient
Procedure SelectAllRun()
	
	For Each AddressClassifierUnit In AddressClassifierUnits Do
		AddressClassifierUnit.Check = True;
	EndDo;
	
EndProcedure

// Handler of command bar click event
// of form item AddressClassifierUnits.
// Removes choice flag for all address units in the list
//
&AtClient
Procedure CancelSelectAllRun()
	
	For Each AddressClassifierUnit In AddressClassifierUnits Do
		AddressClassifierUnit.Check = False;
	EndDo;
	
EndProcedure

// Handler of button "Clear" click event
// Checks data correctness and calls confirmation dialog
// of address information clearing.
//
&AtClient
Procedure ClearExecute()
	
	ClearMessages();
	
	If NumberOfSelectedAddressClassifierUnits() = 0 Then
		CommonUseClientServer.MessageToUser(
					NStr("en = 'It is required to choose minimum one address unit'"), ,
						 "AddressClassifierUnits");
		Return;
	EndIf;
	
	QuestionText = NStr("en = 'Address data on selected objects will be deleted. Do you want to continue?'");
	ReturnCode = DoQueryBox(QuestionText, QuestionDialogMode.OKCancel);
	
	If ReturnCode = DialogReturnCode.OK Then
		ClearAddressInfo();
		DoMessageBox(NStr("en = 'Address data deleted successfully'"),,
		             NStr("en = 'Deleting address data'"));
		Notify("AddressClassifierUpdate");
		Close(True);
	EndIf;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// Block of service functions
//

// Fill passed value table using values of address units table.
// Select code, description and object type abbreviation.
//
&AtServer
Procedure FillTableByAddressClassifierUnitsLayout()
	
	AddressClassifierUnits.Clear();
	
	AddressClassifierUnitsClassifierXML =
	   InformationRegisters.AddressClassifier.GetTemplate("AddressClassifierUnits").GetText();
	
	ClassifierTable = CommonUse.ReadXMLToTable(AddressClassifierUnitsClassifierXML).Data;
	
	For Each Unit In ClassifierTable Do
		
		Description = Left(Unit.Code, 2)
		             + " - "
		             + Unit.Name
		             + " "
		             + Unit.Abbreviation;
		
		NewRow = AddressClassifierUnits.Add();
		NewRow.Check             = False;
		NewRow.Description = Description;
		
	EndDo;
	
EndProcedure

// Returns the number of marked address units
//
&AtClient
Function NumberOfSelectedAddressClassifierUnits()
	
	NumberOfSelectedAddressClassifierUnits = 0;
	
	For Each AddressClassifierUnit In AddressClassifierUnits Do
		If AddressClassifierUnit.Check Then
			NumberOfSelectedAddressClassifierUnits = NumberOfSelectedAddressClassifierUnits + 1;
		EndIf;
	EndDo;
	
	Return NumberOfSelectedAddressClassifierUnits;
	
EndFunction

// Deletes address info using selected address units
//
&AtServer
Procedure ClearAddressInfo()
	
	// generate list of address units for address information clearing
	
	SelectedAO = New Array;
	
	For Each AddressClassifierUnit In AddressClassifierUnits Do
		If AddressClassifierUnit.Check Then
			SelectedAO.Add(Left(AddressClassifierUnit.Description, 2));
		EndIf;
	EndDo;
	
	AddressClassifier.DeleteAddressInfo(SelectedAO);
	AddressClassifier.LoadFirstLevelAddressClassifierUnits();
	
EndProcedure
